const arr=[
    {
     "q": "في نظام المعلومات ندرس  المنظمة",
     "a1": "التطبيقات ",
     "a2": "أنظمة التشغيل ",
     "a3": "او ب معا",
     "a4": "لاشى مما سبق",
     "an": "او ب معا"
    },
    {
     "q": "عناصر تكنولوجيا المعلومات ",
     "a1": "مكونات مادية و برمجية ",
     "a2": "تكنولوجيا التخزين",
     "a3": "تكنولوجيا الاتصلات ",
     "a4": "جميع ما سبق",
     "an": "جميع ما سبق"
    },
    {
     "q": "يقصد ب الأجهزة ",
     "a1": "اجهز التخزين",
     "a2": "وحدة المعالجه المركزية",
     "a3": "الذاكرة الرئيسية",
     "a4": "جميع ما سبق",
     "an": "جميع ما سبق"
    },
    {
     "q": "نظام ويندوز من  ",
     "a1": "أنظمة التشغيل ",
     "a2": "التطبيقات ",
     "a3": "او ب معا",
     "a4": "لاشى مما سبق",
     "an": "أنظمة التشغيل "
    },
    {
     "q": "المعالجة هي عملات ",
     "a1": "حسابية ",
     "a2": "منطقية",
     "a3": "او ب معا",
     "a4": "لاشى مما سبق",
     "an": "او ب معا"
    },
    {
     "q": "نظام المعلومات هو نظام ......و يتكون من عدة نظم فرعية ",
     "a1": "مغلق",
     "a2": "مفتوح",
     "a3": "شبة مغلق",
     "a4": "لاشى مما سبق",
     "an": "مفتوح"
    },
    {
     "q": "وثائق و سجلات المؤسسة من المصادر ",
     "a1": "داخية ",
     "a2": "خارجية",
     "a3": "او ب معا",
     "a4": "لاشى مما سبق",
     "an": "داخية "
    },
    {
     "q": "اراء و مقترحات العاملين و العملاء من المصادر ",
     "a1": "الرسمية",
     "a2": "غير الرسمية",
     "a3": "او ب معا",
     "a4": "لاشى مما سبق",
     "an": "غير الرسمية"
    },
    {
     "q": "في مخطط تجزئة العمل WBS يقسم كل ",
     "a1": " نشاط الي عدد من المهام ",
     "a2": " مهمة الي عدد من الانشطة",
     "a3": "مشروع الي عدد من المهام",
     "a4": "لاشى مما سبق",
     "an": " نشاط الي عدد من المهام "
    },
    {
     "q": "في قاعد البيانات العلائقية تجمع البيانات في جداول ",
     "a1": "ثلاثية الابعاد",
     "a2": "ثنائية الابعاد",
     "a3": "او ب معا",
     "a4": "لاشى مما سبق",
     "an": "ثنائية الابعاد"
    },
    {
     "q": "يرمز للصفة ذات القيمة المتععدة ب",
     "a1": "شكل بيضاوي منقط",
     "a2": "شكلين بيضاوين متداخلين ",
     "a3": "خط اسفل النص",
     "a4": "لاشى مما سبق",
     "an": "شكلين بيضاوين متداخلين "
    },
    {
     "q": "نظام ادرارة التصنيع يتحكم في عمليات ",
     "a1": "الإنتاج  الداخلية ",
     "a2": "الإنتاج الخارجية ",
     "a3": "المتعلقة بالموظفين ",
     "a4": "المتعلقة ب الوثائق",
     "an": "الإنتاج  الداخلية "
    },
    {
     "q": "نظام يدعم تخزين الوثائق و الوصول اليها في حميع أجزاء المنظمة ",
     "a1": "نظام إدارة التصنيع ",
     "a2": "نظام ذكاء الاعمال ",
     "a3": "نظام دعم التعاون",
     "a4": "لاشى مما سبق",
     "an": "لاشى مما سبق"
    },
    {
     "q": "تمثل ..... نقطة البدايه في activity diagram",
     "a1": "end state",
     "a2": "initial state",
     "a3": "final state",
     "a4": "fuck state",
     "an": "initial state"
    },
    {
     "q": "تستخدم decision node and branching",
     "a1": "في حالة اتخاذ قرار بين خيارين",
     "a2": "عملية يتفرع منها عمليات بحسب شروط ",
     "a3": "او ب معا",
     "a4": "لاشى مما سبق",
     "an": "او ب معا"
    },
    {
     "q": "عناصر دراسة الجدوى",
     "a1": 1,
     "a2": 2,
     "a3": 3,
     "a4": 4,
     "an": 4
    },
    {
     "q": "مرحلة التشغيل من التكاليف",
     "a1": "الاستثمارية",
     "a2": "الجارية",
     "a3": "او ب معا",
     "a4": "لاشى مما سبق",
     "an": "الجارية"
    },
    {
     "q": "تضاف قيمة الأصول المقدرة ب .... من التكلفة الإجمالية كاحتياطى",
     "a1": "5%",
     "a2": "10%",
     "a3": "15%",
     "a4": "20%",
     "an": "10%"
    },
    {
     "q": "الفرق بين التدفقات الداخله و الخارجه سنويا ",
     "a1": "صافي الدخل",
     "a2": "صافي الأرباح",
     "a3": "صافي التدفقات النقدية",
     "a4": "لاشى مما سبق",
     "an": "صافي التدفقات النقدية"
    },
    {
     "q": "تطوير المشروع بحيث لا يؤثر علي ساعات العمل ",
     "a1": "دراسة الجدوي الفنية ",
     "a2": "القانونية",
     "a3": "التشغيلية",
     "a4": "لاشى مما سبق",
     "an": "التشغيلية"
    },
    {
     "q": "حالة الاستخدام هي مجموعه من .... التي تصف التفاعل بين المستخدم و النظام ",
     "a1": "الأوامر",
     "a2": "السناريوهات",
     "a3": "المصطلحات",
     "a4": "لاشى مما سبق",
     "an": "السناريوهات"
    },
    {
     "q": "نادرا ما تكون العمليات",
     "a1": "مرئية",
     "a2": "مخفية",
     "a3": "او ب معا",
     "a4": "لاشى مما سبق",
     "an": "مخفية"
    },
    {
     "q": "دفتره نظام معلومات جاهز لإدارة ",
     "a1": "علاقات العملاء",
     "a2": "اعمال المؤسسة",
     "a3": "سلسلة التوريد",
     "a4": "لاشى مما سبق",
     "an": "اعمال المؤسسة"
    },
    {
     "q": "نظام إدارة سلسلة التوريد SCM يقوم ب إدارة ... المتعلقة ب المنتجات أو الخدمات بدأ من شراء المواد حتي التسليم",
     "a1": "السلع",
     "a2": "البيانات",
     "a3": "الأموال",
     "a4": "جميع ما سبق",
     "an": "جميع ما سبق"
    },
    {
     "q": "نظام ذكاء الاعمال SBI يدعم التخطيط الاستراتيجي ",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "تخطيط موارد المؤسسة ERP عملية تلتزم فيها المؤسسة باستخدام مجموعة متكاملة من حزم البرامج لنظم المعلومات الرئيسية ",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "قاعدة البيانات مجموعة بيانات تتم ادارتها مركزيا و يمكن للعديد من النظم و المستخدمين الوصول اليها",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "تحديد و صياغة الأهداف و المشكلة من عملية التخطيط",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "التصميم هو ثاني عملية بعد التخطيط ",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "يكتب الكود في عملة التنفيذ",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "يقصد ب SDLC دورة حياة تطوير نظم المعلومات ",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "نظام المعلومات يقوم ب مهام أوسع من التطبيق",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "يستخدم ال fork في حالة وجود عملية معتمدة بشكل قطعي علي عمليات اخري ",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "ال join  تستخدم في حالة وجود عمليات تؤدي الي مكان واحد ",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "ال merge في حال تقاطع عمليتين في نقطة واحده",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "تكنولوجيا المعلومات اصطلاح يعبر عن تطوير إدارة معدات الكمبيوتر hardware",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "النظام يتكون من مجموعة نظم فرعية ",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "نظام المعلومات يدعم تسديد احتياجات المؤسسة",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "من مميزات نظام المعلومات القائم علي استخدام الحاسب CBIS السرعة و الأمان",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "قاعدة البيانات عبارة عن مجموعة منظمة من المعلومات",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "الانترنت هو شبكة تتكون من ملايين الشبكات المترابطة معا ",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "من أنواع النظم النظام المغلق و المفتوح فقط",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "البيانات ليس لها قيمة لدي المنظمة",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "التغذية العكسية من مدخلات النظام ",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "شبكة الويب تعتبر من الطرق التقليدية لجمع البيانات",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "في قواعد البيانات الصفوف تستخدم لاظهار صفات البيانات",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "لا يوجد علاقة بين صفوف و أعمدة قواعد البيانات ",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "يمثل الصف كائن مستقل بذاتة في قواعد البيانات ",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "يرمز للكيان الضعيف ب مربع بينما للكيان بمستطيل في ERD",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "تمثل العلاقة بمعين في ERD",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "تتكون الصفة المركبة من صفة بسيطة  في ERD",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "نظم المحاسبة و الإدارة المالية AFM نظام يسجل المعلومات المحاسبية الازمة لانتاج البيانات الازمة و التقارير المالية الأخرى",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "نظم إدارة الموارد البشارية نظام يدعم المهام المتعلقة بالموظفين ",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "تهدف دراسة الجدوى الي أخذ قرار قبول المشروع أو رفضه اذا توافر أكثر من مشروع",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "تقوم دراسة الجدوى ب اختيار المشروع الافضل اذا كان القرار يتعلق ب أكثر من مشروع",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "التدفقات الداخله و الخارجه من عناصر دراسة الجدوى",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "تجارب بدء التشغيل تعتبر من التكاليف الاستثمارية",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "الأصول الثابته من التكاليف الاستثمارية و تتمثل في اي الأصول قصيرة الأجل",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "لغة النمذجة تعبر عن منهجية",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "لغة النمذجة أصبحت معيارا عالميا لأنها موحدة",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "لغة النمذجة لغة رسومية",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "غالبا ما تستخدم لغة النمذجة للتعبير عن التحليل الموجة للكائنات OO",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "حالة الاستخدام هي نموذج للتفاعل بين المستخدمين الخارجين بعضهم البعض",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "يرمز ب الجهات الفاعلة بشكل انسان",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "الجهات الفاعلة يمكن أن تكون مستخدمين بشريين أو أنظمة أخري مثل الروبوت",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "يستخدم التضمين في حالة الاستخدام لتجنب تقرار العمليات",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "التمديد في حالة الاستخدام يضيف سلوك الي حالة الاستخدام الأساسية و يجب تنفيذه دائما",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "البرمجه كيانية التوجه مفهوم الكائنات التي تحتوي علي حقول بيانات يكتب داخلها الإجراءات",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "البرمجه الوظيفه لا تهتم ب الصفات المترابطة",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "ال object يستخدم لإنشاء مجموعة من المنتجات المتشابهه",
     "a1": "صح",
     "a2": "خطا",
     "an": "خطا"
    },
    {
     "q": "البرامج مفتوحة المصدر هي البرامج التي تقدر علي التغير في مصدرها",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "يمكن بيع البرامج مفتوحة المصدر بعد التعديل عليها",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "نظام إدارة علاقات العملاء CRM يدعم عمليات التسويق و المبيعات",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    },
    {
     "q": "نظام دعم التعاون CSS يمكن العاملين الموزعين جغرافيا علي التعاون",
     "a1": "صح",
     "a2": "خطا",
     "an": "صح"
    }
   ]
 